In [1]:
import pandas as pd

people = {
    "name":["Abhishek", "Jane", "John"],
    "age" : [32, 45, 56],
    "email":["abhi.gmail.com", "a1.gmail.com", "b1.gmail.com"]
}

In [2]:
df = pd.DataFrame(people)

In [3]:
df

       name  age           email
0  Abhishek   32  abhi.gmail.com
1      Jane   45    a1.gmail.com
2      John   56    b1.gmail.com

In [4]:
df[['email', 'name']]
df.iloc[[1,2], 2]

df.loc[[1,2], ['email', 'age']]

          email  age
1  a1.gmail.com   45
2  b1.gmail.com   56

In [5]:
df.set_index('email', inplace=True)

In [6]:
df.index

Index(['abhi.gmail.com', 'a1.gmail.com', 'b1.gmail.com'], dtype='object', name='email')

In [7]:
df

                    name  age
email
abhi.gmail.com  Abhishek   32
a1.gmail.com        Jane   45
b1.gmail.com        John   56

In [8]:
df.loc['a1.gmail.com']

name    Jane
age       45
Name: a1.gmail.com, dtype: object

In [9]:
df.loc['a1.gmail.com', 'age']

45

In [10]:
df.reset_index(inplace=True)

In [11]:
df

            email      name  age
0  abhi.gmail.com  Abhishek   32
1    a1.gmail.com      Jane   45
2    b1.gmail.com      John   56

In [12]:
filt = (df['name'] == 'Abhishek')  #filter criteria

In [13]:
filt

0     True
1    False
2    False
Name: name, dtype: bool

In [14]:
df[filt]  #extract data from data frame

            email      name  age
0  abhi.gmail.com  Abhishek   32

In [15]:
df.loc[filt]

            email      name  age
0  abhi.gmail.com  Abhishek   32

In [16]:
df.loc[filt, 'age']

0    32
Name: age, dtype: int64

In [17]:
filt = (df['name'] == 'Abhishek') & (df['age'] == 23)

In [18]:
df.columns

Index(['email', 'name', 'age'], dtype='object')

In [19]:
df.columns = ['first_name', 'last_name', 'email']

In [20]:
df

       first_name last_name  email
0  abhi.gmail.com  Abhishek     32
1    a1.gmail.com      Jane     45
2    b1.gmail.com      John     56

In [21]:
df.columns = [x.upper() for x in df.columns] #make all column names to upper case

In [22]:
df

       FIRST_NAME LAST_NAME  EMAIL
0  abhi.gmail.com  Abhishek     32
1    a1.gmail.com      Jane     45
2    b1.gmail.com      John     56

In [23]:
df.columns = df.columns.str.replace(' ', '_') #using string methods

In [30]:
df.rename(columns={'FIRST_NAME': 'first', 'LAST_NAME':'last'}, inplace=True)

In [31]:
df

            first      last  EMAIL
0  abhi.gmail.com  Abhishek     32
1    a1.gmail.com      Jane     45
2    b1.gmail.com      John     56

In [32]:
df.loc[2]

first    b1.gmail.com
last             John
EMAIL              56
Name: 2, dtype: object

In [35]:
df.loc[2,['last', 'EMAIL']] = ['Ram', 'Ram@gmail.com']  #change a specific row

In [37]:
df.at[2, 'last'] = 'Doe'

In [38]:
df

            first      last          EMAIL
0  abhi.gmail.com  Abhishek             32
1    a1.gmail.com      Jane             45
2    b1.gmail.com       Doe  Ram@gmail.com

In [ ]:
df['email'].str.lower() # change the entire row to lower case

In [41]:
df['last'].apply(len)

0    8
1    4
2    3
Name: last, dtype: int64

In [44]:
def update_first(first):
    return first.upper()

df['first'].apply(update_first)

0    ABHI.GMAIL.COM
1      A1.GMAIL.COM
2      B1.GMAIL.COM
Name: first, dtype: object

In [46]:
#using lambda func
df['last'] = df['last'].apply(lambda x: x.lower())